app/controllers/manage/activities_controller.rb

  def index
    @limit = get_limit
    @offset = get_offset(params)
    @activities_count = Activity.count
---
SELECT count(*) AS count_all FROM `activities`

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)

  def update
    @activity = Activity.find(params[:id])
    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
UPDATE `activities` SET `description` = 'will be updated.', `updated_at` = '2012-06-03 00:25:47' WHERE `id` = 1