app/controllers/manage/challenges_controller.rb

  def index
    @limit = get_limit
    @offset = get_offset(params)
    @challenges_count = Challenge.count
    if !params[:sort].nil? then
      if !params[:asc].nil? then
        asc = params[:asc]
      else
        asc = ""
      end
      if params[:sort] == "alpha" then
        @challenges = Challenge.find_all_order_by_with_limit_and_offset("name", asc, "", @limit, @offset)
      elsif params[:sort] == "date" then
        @challenges = Challenge.find_all_order_by_with_limit_and_offset("start_date", asc, "", @limit, @offset)
      elsif params[:sort] == "offer" then
        @challenges = Challenge.find_all_order_by_with_limit_and_offset("total_offer", asc, "", @limit, @offset)
      elsif params[:sort] == "raised" then
        @challenges = Challenge.find_all_order_by_with_limit_and_offset("amount_raised", asc, "", @limit, @offset)
      elsif params[:sort] == "activity" then
        @challenges = Challenge.find_all_order_by_challenge_activities_date("", asc, @limit, @offset)
---
SELECT count(*) AS count_all FROM `challenges`
SELECT * FROM `challenges` WHERE (enabled = '1' or enabled = '0') LIMIT 10
SELECT `activities`.* FROM `activities` INNER JOIN `challenge_activities` ON `activities`.id = `challenge_activities`.activity_id WHERE ((`challenge_activities`.challenge_id = 1))

  def show
    if !params[:id].to_s.match(/^\d+$/)
      @challenge = Challenge.find_by_seo_name(params[:id])
    else
      @challenge = Challenge.find(params[:id])
---
SELECT * FROM `challenges` WHERE (`challenges`.`id` = 4)

  def edit
    if !params[:id].to_s.match(/^\d+$/)
      @challenge = Challenge.find_by_seo_name(params[:id])
    else
      @challenge = Challenge.find(params[:id])
---
SELECT * FROM `challenges` WHERE (`challenges`.`id` = 5)

  def create
    @challenge = Challenge.new(params[:challenge])

    respond_to do |format|
      if @challenge.save then
---
INSERT INTO `challenges` (`name`, `description`, `start_date`, `end_date`, `created_at`, `updated_at`, `challenge_img`, `total_offer`, `amount_raised`, `sponsor_blurb`, `charity_blurb`, `enabled`, `created_by_user_id`, `seo_name`, `img_thumb_url`) VALUES('test challenge 2', 'test ing ', '2012-01-05', NULL, '2012-05-08 08:49:39', '2012-05-08 08:49:39', '--- !ruby/object:File {}\n', 1000.0, 7.5, 'test me ', 'test you?', 0, 2, 'test-challenge-2', '--- !ruby/object:File {}\n')

            end
          end
        end
        @challenge.update_attribute(:challenge_img,params[:challenge][:challenge_img])
---
UPDATE `challenges` SET `challenge_img` = '/uploads/challenges/4/ocean_beach_nov2011.jpg', `updated_at` = '2012-05-08 08:49:39' WHERE `id` = 4

        format.html { redirect_to([:manage, @challenge]) }
        format.xml { render :xml => @challenge, :status => :created, :location => @challenge }
      else
        @charities = Charity.find(:all, :order => :name)
        @sponsors = Sponsor.find(:all, :order => :name)
        @activities = Activity.find(:all, :order => :name)
        @tags = Tag.find(:all, :order => :name)
---
SELECT `charities`.id FROM `charities` WHERE (`charities`.`name` = BINARY 'Sean\'s other new charity of fire' AND `charities`.id <> 5) LIMIT 1
SELECT `sponsors`.id FROM `sponsors` WHERE (`sponsors`.`name` = BINARY 'Big Money Sponsor' AND `sponsors`.id <> 2) LIMIT 1
SELECT * FROM `activities` WHERE (`activities`.`id` IN (2,1))
SELECT `tags`.id FROM `tags` WHERE (`tags`.`name` = BINARY 'Pappa\'s got a brand new new tag ' AND `tags`.id <> 1) LIMIT 1

  def update
    @challenge = Challenge.find(params[:id])
    if !params[:challenge][:challenge_img].nil? && params[:challenge][:challenge_img] != "" then
      uploaded_io = params[:challenge][:challenge_img]
      if uploaded_io != "" then
        upload_dir = image_upload_path + "challenges/#{@challenge.id}/"
        if !File.exists?(upload_dir) then
          Dir.mkdir(upload_dir)
        end
        File.open(upload_dir + uploaded_io.original_filename, 'w') do |file|
          file.write(uploaded_io.read)
          params[:challenge][:challenge_img] = "/uploads/challenges/#{@challenge.id}/" + File.basename(file.path)
        end
      end
    end
    if !params[:challenge][:img_thumb_url].nil? && params[:challenge][:img_thumb_url] != "" then
      uploaded_io = params[:challenge][:img_thumb_url]
      if uploaded_io != "" then
        upload_dir = image_upload_path + "challenges/#{@challenge.id}/"
        if !File.exists?(upload_dir) then
          Dir.mkdir(upload_dir)
        end
        File.open(upload_dir + uploaded_io.original_filename, 'w') do |file|
          file.write(uploaded_io.read)
          params[:challenge][:img_thumb_url] = "/uploads/challenges/#{@challenge.id}/" + File.basename(file.path)
        end
      end
    end
    respond_to do |format|
      if @challenge.update_attributes(params[:challenge]) then
---
SELECT * FROM `challenges` WHERE (`challenges`.`id` = 5)
UPDATE `challenges` SET `start_date` = '2012-05-05', `end_date` = '2012-06-05', `updated_at` = '2012-05-08 09:01:31' WHERE `id` = 5

        format.html { redirect_to([:manage, @challenge]) }
        format.xml { head :ok }
      else
        @charities = Charity.find(:all, :order => :name)
        @sponsors = Sponsor.find(:all, :order => :name)
        @activities = Activity.find(:all, :order => :name)
        @tags = Tag.find(:all, :order => :name)
---
SELECT * FROM `charities` WHERE (`charities`.`id` IN (5,1,4,6,8,3))
SELECT * FROM `sponsors` WHERE (`sponsors`.`id` IN (2,4,3,1))
SELECT * FROM `activities` WHERE (`activities`.`id` IN (2,1))
SELECT * FROM `tags` WHERE (`tags`.`id` IN (1,2))