app/controllers/manage/charities_controller.rb

  def index
    @limit = get_limit
    @offset = get_offset(params)
    @charities_count = Charity.count
    if !params[:sort].nil? then
      if !params[:asc].nil? then
        asc = params[:asc]
      else
        asc = ""
      end
      if params[:sort] == "alpha" then
        @charities = Charity.find_all_order_by_with_limit_and_offset("name", asc, "", @limit, @offset)
---
SELECT count(*) AS count_all FROM `charities`
SELECT * FROM `charities` WHERE (enabled = '1' or enabled = '0') ORDER BY created_at asc LIMIT 10

  def show
    if !params[:id].to_s.match(/^\d+$/)
      @charity = Charity.find_by_seo_name(params[:id])
    else
      @charity = Charity.find(params[:id])
---
SELECT * FROM `charities` WHERE (`charities`.`id` = 1)

  def new
    @charity = Charity.new
    @states = State.find(:all, :order => :name)
    @countries = Country.find(:all, :conditions => {:printable_name => "United States"}, :order => :printable_name)
---
SELECT * FROM `countries` WHERE (`countries`.`printable_name` = 'United States') ORDER BY printable_name

  def edit
    logger.debug "TRACE: #{__LINE__} : params.inspect #{params.inspect} "
    if !params[:id].to_s.match(/^\d+$/)
      @charity = Charity.find_by_seo_name(params[:id])
      logger.info "TRACE: #{__LINE__} : @charity.id #{@charity.id}"
    else
      @charity = Charity.find(params[:id])
    end
    @states = State.find(:all, :order => :name)
    @countries = Country.find(:all, :conditions => {:printable_name => "United States"}, :order => :printable_name)
---
SELECT * FROM `charities` WHERE (`charities`.`id` = 1)
SELECT * FROM `countries` WHERE (`countries`.`printable_name` = 'United States') ORDER BY printable_name

  def create
    logger.debug "TRACE: #{__LINE__} : params.inspect #{params.inspect} "
    @charity = Charity.new(params[:charity])

    respond_to do |format|
      if @charity.save then
---
INSERT INTO `charities` (`email`, `enabled`, `name`, `address1`, `address2`, `city`, `state`, `province`, `postal_code`, `country`, `phone_number`, `image_url`, `website`, `created_at`, `updated_at`, `created_by_user_id`, `seo_name`, `img_thumb_url`) VALUES('newjune@newcharity.tv', 0, 'New June Charity', 'test street', 'test street 2', 'city ', 'CA', NULL, '94100', 'US', '', NULL, 'new June dot com', '2012-06-03 00:05:18', '2012-06-03 00:05:18', 2, 'new-june-charity', NULL)

            end
          end
        end
        @charity.update_attribute(:image_url,params[:charity][:image_url])
---
UPDATE `charities` SET `enabled` = 1, `updated_at` = '2012-06-03 00:05:18' WHERE `id` = 9

        format.xml { render :xml => @charity, :status => :created, :location => @charity }
      else
        @states = State.find(:all, :order => :name)
        @countries = Country.find(:all, :conditions => {:printable_name => "United States"}, :order => :printable_name)
        @tags = Tag.find(:all, :order => :name)
---
SELECT * FROM `countries` WHERE (`countries`.`printable_name` = 'United States') ORDER BY printable_name
SELECT `tags`.id FROM `tags` WHERE (`tags`.`name` = BINARY 'Pappa\'s got a brand new tag' AND `tags`.id <> 1) LIMIT 1

  def update
    @charity = Charity.find(params[:id])
    logger.debug "TRACE: #{__LINE__} : @charity.id #{@charity.id}"
    if !params[:id].to_s.match(/^\d+$/)
      @charity = Charity.find_by_seo_name(params[:id])
      logger.info "TRACE: #{__LINE__} : @charity.id #{@charity.id}"
    else
      @charity = Charity.find(params[:id])
---
SELECT * FROM `charities` WHERE (`charities`.`id` = 1)
SELECT `charities`.id FROM `charities` WHERE (`charities`.`name` = BINARY 'test charity 1' AND `charities`.id <> 1) LIMIT 1

      end
    end
    respond_to do |format|
      if @charity.update_attributes(params[:charity]) then
---
UPDATE `charities` SET `image_url` = '/uploads/charities/7/el_capitan_thumb.jpg', `img_thumb_url` = '/uploads/charities/7/ocean_beach_nov2011.jpg', `updated_at` = '2012-05-30 07:25:35' WHERE `id` = 7

      else
        @states = State.find(:all, :order => :name)
        @countries = Country.find(:all, :conditions => {:printable_name => "United States"}, :order => :printable_name)
        @tags = Tag.find(:all, :order => :name)
---
SELECT * FROM `tags` WHERE (`tags`.`id` IN (1,2))