app/controllers/manage/search_controller.rb

  def activities
    @limit = get_limit
    @offset = get_offset(params)
    if !params[:keyword].nil?
      @results_count = Activity.count(:conditions => [ "name like :kw or description like :kw", { :kw => "%" + params[:keyword].to_s + "%" }])
      @activities = Activity.find(:all,
                                :conditions => [ "name like :kw or description like :kw", { :kw => "%" + params[:keyword].to_s + "%" }],
                                :limit => @limit,
                                :offset => @offset)
---
SELECT count(*) AS count_all FROM `activities` WHERE (name like '%Share %' or description like '%Share %')
SELECT * FROM `activities` WHERE (name like '%Share %' or description like '%Share %') LIMIT 10

  def challenges
    @limit = get_limit
    @offset = get_offset(params)
    if !params[:keyword].nil?
      @results_count = Challenge.count(:conditions => [ "name like :kw or description like :kw", { :kw => "%" + params[:keyword].to_s + "%" }])
      @challenges = Challenge.find(:all,
                                :conditions => [ "name like :kw or description like :kw", { :kw => "%" + params[:keyword].to_s + "%" }],
                                :limit => @limit,
                                :offset => @offset)
---
SELECT count(*) AS count_all FROM `challenges` WHERE (name like '%1%' or description like '%1%')
SELECT * FROM `challenges` WHERE (name like '%1%' or description like '%1%') LIMIT 10

  def charities
    @limit = get_limit
    @offset = get_offset(params)
    if !params[:keyword].nil?
      @results_count = Charity.count(:conditions => [ "name like :kw or email like :kw", { :kw => "%" + params[:keyword].to_s + "%" }])
      @charities = Charity.find(:all,
                                :conditions => [ "name like :kw or email like :kw", { :kw => "%" + params[:keyword].to_s + "%" }],
                                :limit => @limit,
                                :offset => @offset)
---
SELECT count(*) AS count_all FROM `charities` WHERE (name like '%toe%' or email like '%toe%')
SELECT * FROM `charities` WHERE (name like '%toe%' or email like '%toe%') LIMIT 10

  def sponsors
    @limit = get_limit
    @offset = get_offset(params)
    if !params[:keyword].nil?
      @results_count = Sponsor.count(:conditions => [ "name like :kw or email like :kw", { :kw => "%" + params[:keyword].to_s + "%" }])
      @sponsors = Sponsor.find(:all,
                                :conditions => [ "name like :kw or email like :kw", { :kw => "%" + params[:keyword].to_s + "%" }],
                                :limit => @limit,
                                :offset => @offset)
---
SELECT count(*) AS count_all FROM `sponsors` WHERE (name like '%big%' or email like '%big%')
SELECT * FROM `sponsors` WHERE (name like '%big%' or email like '%big%') LIMIT 10

  def user_activities
    @limit = get_limit
    @offset = get_offset(params)
    if !params[:keyword].nil?
      @results_count = UserActivity.count(:conditions => [ "activity_data like :kw", { :kw => "%" + params[:keyword].to_s + "%" }])
      @user_activities = UserActivity.find(:all,
                                           :conditions => [ "activity_data like :kw", { :kw => "%" + params[:keyword].to_s + "%" }],
                                           :limit => @limit,
                                           :offset => @offset)
---
SELECT count(*) AS count_all FROM `user_activities` WHERE (activity_data like '%1%')
SELECT * FROM `user_activities` WHERE (activity_data like '%1%') LIMIT 10