app/controllers/manage/sponsors_controller.rb

  def index
    @limit = get_limit
    @offset = get_offset(params)
    @sponsors_count = Sponsor.count
    if !params[:sort].nil? then
      if !params[:asc].nil? then
        asc = params[:asc]
      else
        asc = ""
      end
      if params[:sort] == "alpha" then
        @sponsors = Sponsor.find_all_order_by_with_limit_and_offset("name", asc, "", @limit, @offset)
---
SELECT count(*) AS count_all FROM `sponsors`
SELECT * FROM `sponsors` WHERE (enabled = '1' or enabled = '0') ORDER BY created_at desc LIMIT 10

  def show
    if !params[:id].to_s.match(/^\d+$/)
      @sponsor = Sponsor.find_by_seo_name(params[:id])
    else
      @sponsor = Sponsor.find(params[:id])
---
SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = 5)

  def new
    @sponsor = Sponsor.new
    @states = State.find(:all, :order => :name)
    @countries = Country.find(:all, :conditions => {:printable_name => "United States"}, :order => :printable_name)
---
SELECT * FROM `countries` WHERE (`countries`.`printable_name` = 'United States') ORDER BY printable_name

  def create
    @sponsor = Sponsor.new(params[:sponsor])

    respond_to do |format|
      if @sponsor.save then
---
INSERT INTO `sponsors` (`email`, `enabled`, `name`, `address1`, `address2`, `city`, `state`, `province`, `postal_code`, `country`, `phone_number`, `image_url`, `website`, `created_at`, `updated_at`, `created_by_user_id`, `seo_name`, `img_thumb_url`) VALUES('email@sponsor.com', 0, 'Just look at this new Sponsor', 'do do da da', 'do do da da', 'do do da da', 'CA', NULL, '94100', 'US', '', NULL, 'sponsor.co.uk', '2012-06-03 00:36:53', '2012-06-03 00:36:53', 2, 'just-look-at-this-new-sponsor', NULL)

        format.xml { render :xml => @sponsor, :status => :created, :location => @sponsor }
      else
        @states = State.find(:all, :order => :name)
        @countries = Country.find(:all, :conditions => {:printable_name => "United States"}, :order => :printable_name)
        @tags = Tag.find(:all, :order => :name)
---
SELECT * FROM `countries` WHERE (`countries`.`printable_name` = 'United States') ORDER BY printable_name
SELECT `tags`.id FROM `tags` WHERE (`tags`.`name` = BINARY 'Pappa\'s got a brand new new tag ' AND `tags`.id <> 1) LIMIT 1