app/controllers/manage/tags_controller.rb

  def index
    @limit = get_limit
    @offset = get_offset(params)
    @tags_count = Tag.count
---
SELECT count(*) AS count_all FROM `tags`

  def show
    @tag = Tag.find(params[:id])
---
SELECT * FROM `tags` WHERE (`tags`.`id` = 1)

  def edit
    @tag = Tag.find(params[:id])
---
SELECT * FROM `tags` WHERE (`tags`.`id` = 1)

  def update
    @tag = Tag.find(params[:id])
    respond_to do |format|
      if @tag.update_attributes(params[:tag])
---
SELECT * FROM `tags` WHERE (`tags`.`id` = 1)
UPDATE `tags` SET `name` = 'Pappa\'s got a brand new new tag ', `updated_at` = '2012-06-03 00:27:59' WHERE `id` = 1

  def destroy
    @tag = Tag.find(params[:id])
---
SELECT * FROM `tags` WHERE (`tags`.`id` = 2)