app/controllers/manage/users_controller.rb

  def index
    @limit = get_limit
    @offset = get_offset(params)
    @users_count = UserActivity.count
---
SELECT count(*) AS count_all FROM `user_activities`

  def destroy
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)