app/controllers/manage/user_activities_controller.rb

  def index
    @limit = get_limit
    @offset = get_offset(params)
    @user_activities_count = UserActivity.count
---
SELECT count(*) AS count_all FROM `user_activities`

  def new
    @users = User.find(:all)
    @challenge_activities = ChallengeActivity.find(:all)
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 2) LIMIT 1