app/controllers/session_controller.rb

  def login
    if request.post?
      email = params[:user][:email]
      password = params[:user][:password]
      referer = params[:referer]
      if !referer.nil? then
        session[:return_to] = referer
      end
      if email.nil? || password.nil? || email == password then
        redirect_to :action => "index"
        flash[:notice] = "Unknown user or invalid password"
      else
        user = User.authenticate(email, password)
        if !user.nil? then
          session[:user_id] = user.id
          user_roles = UserRole.find_all_by_user_id(user.id)
          if !user_roles.nil? && user_roles.length > 0 then
            session_user_roles = Array.new(user_roles.length)
            user_roles.each_with_index do |ur, i|
              session_user_roles[i] = ur.role.name
            end
            session[:user_roles] = session_user_roles
            if user_roles.length == 1 then
              session[:user_role] = user_roles[0]
            end
          end
          flash[:notice] = "Welcome #{user.first_name}"
---
SELECT * FROM `user_roles` WHERE (`user_roles`.`user_id` = 2)
SELECT * FROM `users` WHERE (`users`.`email` = 'bling_czar@hotmail.com') LIMIT 1